app/controllers/grumblers_controller.rb

  def index
    @grumblers = Grumbler.all
---
SELECT "grumblers".* FROM "grumblers"

  def create
    @grumbler = Grumbler.new(grumbler_params)
    if @grumbler.save
---
INSERT INTO "grumblers" ("body", "author", "title", "avatar_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "butt"], ["author", "me"], ["title", "monkey"], ["avatar_url", "you"]]

  def destroy
    @grumbler = Grumbler.find(params[:id])
    if @grumbler.destroy
---
SELECT  "grumblers".* FROM "grumblers" WHERE "grumblers"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "grumblers" WHERE "grumblers"."id" = $1  [["id", 1]]